{"data":{"allStoryYaml":{"nodes":[{"id":"22968463-06f6-54c3-86e6-2be5a89064f1","Title":"The Spark","Content":"<p>The club’s story starts when its founder, Mr. Vipin Pavithran, who worked in the US,\nfor over 10 years experienced in software engineering joined Amrita University in 2006.</p>\n<p>He quickly realised that the students here had little focus, confidence and exposure to\ntake on the real world, due to the absence of proper mentoring and support.</p>\n","Quote":"“One of the vivid memories that I have of my bachelors was lack of support from the institution. I know the value of right guidance at the right time and how it can make a huge impact. This made me want to help any one who needed guidance.”","childFileYaml":{"childImageSharp":{"fluid":{"src":"/static/46c03e23fa4da62b255b5b3918849ff6/bc3a8/vipin_sir.jpg"}}}},{"id":"55847ea5-41f5-52ee-b568-ba62b535c89e","Title":"A Humble Beginning","Content":"<p>In the summer of 2006, he was approached by Abhilash T G seeking mentoring to participate in the\nIBM Great Mind Challenge 2006. Soon a team of enthusiasts was formed, and rigorous preparation had\nstarted. Initially, the students were not really confident of getting selected let alone winning.\nHowever, they were highly motivated and enthusiastic about it. While at the same time, Vipin was however,\nvery confident in his students, and having prior experience in software development was certain\nthat his students would come on top.</p>\n<p>Months went past, with them working day and night under intense preparation focusing only their goal.\nThey missed out on academics and the usual college life, and were often mocked by their classmates.\nInfact, there were instances when nothing went there way and they thought of giving up, but however\nwere pushed forward by Vipin.</p>\n<p>In the end, they ended up among the Top 5 teams from India, and were invited to Mumbai for the\nprize distribution ceremony. This was the first national level prize to be won by Amritapuri students.</p>\n","Quote":"“This was a great confidence booster for not only them but also inspired other students who now thought they too can, if they try. Prior to this most Amrita students believed that to win in a national contest they needed to be from IITs.”","childFileYaml":{"childImageSharp":{"fluid":{"src":"/static/ae2dfde0a5f0155be33b1b61a7a19cb8/af144/ibm-great-mind.png"}}}},{"id":"f7886158-e666-5994-bb05-c939606fa8c5","Title":"Winning the Sun Code for Freedom","Content":"<p>Motivated by the success, Vipin started searching for more contests at national and international level.\nHe then came across the Sun Code For Freedom 200X, conducted  by Sun Microsystems, which was about making\ncontributions to their open source projects.</p>\n<p>It had already been 2 months since the contest started, and Avinash Joshi, a third-year student was\nput on to work on making contribution to Open Solaris, the open sourced version of Solaris operating system\nfrom Sun Microsystems. Avinash who had just completed his course on Operating System was now expected to\ncontribute to one with over 9 million lines of code.</p>\n<p>After two months of intense effort Avinash finally figured out how to contribute, and started contributing\nto it. He also wrote documentation of the whole process, so that his peers could also get started with it.\nSoon many students started contributing to it.</p>\n<p>Every day students would stayback in the lab till late and work on making contributions to various open source\nsoftware from Sun. On the last day of the contest, i.e. 14th February, special permission was granted for the\ngirls too to stayback in the lab till midnight.</p>\n<p>When the contest was judged, Amrita Vishwa Vidyapeetham emerged as the champion university, with 105\ncontributions. The college that came second had only 10 contributions in total. The team were invited to\nHyderabad for the Sun Tech Days 2008 during which the prizes were awarded. After this students started\nregularly contributing to Sun Open Source products with the active support of Sun Microsystems.</p>\n","Quote":null,"childFileYaml":{"childImageSharp":{"fluid":{"src":"/static/ea4be4b1d7290093f57b00774089d678/59139/sun-code-for-freedom.png"}}}},{"id":"21e5f0ef-1866-5fb7-a091-450a33936c5b","Title":"Gaining Recognition through GSoC","Content":"<p>In 2010, Vipin chanced upon Google Summer of Code, and 3 members of the club got selections the very first\ntime. Over the years, through the experiences shared by the seniors, more and more students started\nparticipating in GSoC. Having started with a strength of 10 members, the club now has about 100 active\nmembers, and several alumni actively developing the club</p>\n","Quote":"“They learn valuable skills that is not normally learned in the classrooms such as reading large code base, coding using a certain coding standards, using VCS, communicating effectively via IRC & email. They also practically learn about the software development life cycle.”","childFileYaml":null}]}}}